export const creditProducts = ['Драйв А', 'Драйв Б', 'Драйв В']
export const additionalEquipments = [
  'Светодиодные фары',
  'Защита картера',
  'Парктроник',
  'Комплект зимней резины',
  'Ёлочка ароматная',
]
export const dealerAdditionalServices = ['ОСАГО', 'КАСКО', 'Перекрасить авто']

export const formFields = [
  'Состояние',
  'Марка',
  'Модель',
  'Год выпуска',
  'Стоимость',
  'Пробег',
  'Кредитный продукт',
  'Первоначальный взнос',
  'Срок',
  'Вид оборудования',
  'Тип продукта',
]
