export const formFields = [
  'Состояние',
  'Марка',
  'Модель',
  'Год выпуска',
  'Стоимость',
  'Пробег',
  'Тип ПТС',
  'Серия и номер ПТС',
  'Дата выдачи ПТС',
  'VIN или номер кузова',
  'Номер VIN/кузова',
  'Номер ДКП',
  'Дата ДКП',
  'Юридическое лицо',
  'Сумма кредита',
  'Сумма кредита',

  'БИК',
  'Банк получатель денежных средств',
  'Номер Счета банка',

  'Кредитный продукт',
  'Первоначальный взнос',
  'Первоначальный взнос в %',
  'Срок',

  'Тип доп оборудования',
  'Тип продукта',
  'Страховая компания или поставщик',
  'Агент получатель',
]

export const legalPersons = ['ANEX', 'Рога и копыта']
export const bankIdentificationCodes = ['000000000', '123456789']
export const beneficiaryBanks = ['Сбер', 'НеСбер']
export const bankAccountNumbers = ['1234123412341234', '4321432143214321']

export const provider = ['Хороший поставшик', 'Хорошая страховая компания', 'Так себе поставшик']
export const agent = ['Хороший агент', 'Так себе агент']
