/** Тип района */
export const AREA_TYPES = [
  {
    value: '201',
    label: 'Район',
  },
  {
    value: '203',
    label: 'Территория',
  },
  {
    value: '202',
    label: 'Улус',
  },
]

/** Тип города */
export const CITY_TYPES = [
  {
    value: '310',
    label: 'Волость',
  },
  {
    value: '301',
    label: 'Город',
  },
  {
    value: '305',
    label: 'Дачный поселок',
  },
  {
    value: '304',
    label: 'Курортный поселок',
  },
  {
    value: '302',
    label: 'Поселок городского типа',
  },
  {
    value: '311',
    label: 'Почтовое отделение',
  },
  {
    value: '303',
    label: 'Рабочий (заводской) поселок',
  },
  {
    value: '307',
    label: 'Сельская администрация',
  },
  {
    value: '313',
    label: 'Сельская территория',
  },
  {
    value: '309',
    label: 'Сельский округ',
  },
  {
    value: '308',
    label: 'Сельское муницип. образование',
  },
  {
    value: '314',
    label: 'Сельское поселение',
  },
  {
    value: '306',
    label: 'Сельсовет',
  },
  {
    value: '312',
    label: 'Территория',
  },
]

/** Тип улицы */
export const STREET_TYPES = [
  {
    value: '532',
    label: 'Аал',
  },
  {
    value: '501',
    label: 'Аллея',
  },
  {
    value: '533',
    label: 'Аул',
  },
  {
    value: '502',
    label: 'Бульвар',
  },
  {
    value: '503',
    label: 'Въезд',
  },
  {
    value: '534',
    label: 'Выселки(ок)',
  },
  {
    value: '535',
    label: 'Городок',
  },
  {
    value: '536',
    label: 'Деревня',
  },
  {
    value: '504',
    label: 'Дорога',
  },
  {
    value: '539',
    label: 'ж/д остановочный (обгонный) пункт',
  },
  {
    value: '537',
    label: 'Железнодорожная будка',
  },
  {
    value: '538',
    label: 'Железнодорожная казарма',
  },
  {
    value: '559',
    label: 'Железнодорожная платформа',
  },
  {
    value: '542',
    label: 'Железнодорожная станция',
  },
  {
    value: '540',
    label: 'Железнодорожный пост',
  },
  {
    value: '541',
    label: 'Железнодорожный разъезд',
  },
  {
    value: '505',
    label: 'Животноводческая точка',
  },
  {
    value: '506',
    label: 'Заезд',
  },
  {
    value: '507',
    label: 'Квартал',
  },
  {
    value: '508',
    label: 'Километр',
  },
  {
    value: '509',
    label: 'Кольцо',
  },
  {
    value: '510',
    label: 'Линия',
  },
  {
    value: '544',
    label: 'Местечко',
  },
  {
    value: '545',
    label: 'Микрорайон',
  },
  {
    value: '511',
    label: 'Набережная',
  },
  {
    value: '546',
    label: 'Населенный пункт',
  },
  {
    value: '512',
    label: 'Остров',
  },
  {
    value: '513',
    label: 'Парк',
  },
  {
    value: '515',
    label: 'Переезд',
  },
  {
    value: '514',
    label: 'Переулок',
  },
  {
    value: '550',
    label: 'Планировочный район',
  },
  {
    value: '547',
    label: 'Платформа',
  },
  {
    value: '517',
    label: 'Площадка',
  },
  {
    value: '516',
    label: 'Площадь',
  },
  {
    value: '552',
    label: 'Полустанок',
  },
  {
    value: '551',
    label: 'Поселок и(при) станция(и)',
  },
  {
    value: '548',
    label: 'Поселок сельского типа',
  },
  {
    value: '553',
    label: 'Починок',
  },
  {
    value: '549',
    label: 'Почтовое отделение',
  },
  {
    value: '518',
    label: 'Проезд',
  },
  {
    value: '520',
    label: 'Просек',
  },
  {
    value: '521',
    label: 'Проселок',
  },
  {
    value: '519',
    label: 'Проспект',
  },
  {
    value: '522',
    label: 'Проулок',
  },
  {
    value: '554',
    label: 'Разъезд',
  },
  {
    value: '523',
    label: 'Сад',
  },
  {
    value: '555',
    label: 'Село',
  },
  {
    value: '524',
    label: 'Сквер',
  },
  {
    value: '556',
    label: 'Слобода',
  },
  {
    value: '557',
    label: 'Станция',
  },
  {
    value: '525',
    label: 'Строение',
  },
  {
    value: '526',
    label: 'Территория',
  },
  {
    value: '527',
    label: 'Тракт',
  },
  {
    value: '528',
    label: 'Тупик',
  },
  {
    value: '529',
    label: 'Улица',
  },
  {
    value: '530',
    label: 'Участок',
  },
  {
    value: '558',
    label: 'Хутор',
  },
  {
    value: '531',
    label: 'Шоссе',
  },
]

/** Тип населенного пункта */
export const SETTLEMENT_TYPES = [
  {
    value: '401',
    label: 'Аал',
  },
  {
    value: '402',
    label: 'Аул',
  },
  {
    value: '403',
    label: 'Волость',
  },
  {
    value: '404',
    label: 'Выселки(ок)',
  },
  {
    value: '405',
    label: 'Город',
  },
  {
    value: '436',
    label: 'Городок',
  },
  {
    value: '407',
    label: 'Дачный поселок',
  },
  {
    value: '406',
    label: 'Деревня',
  },
  {
    value: '410',
    label: 'ж/д остановочный (обгонный) пункт',
  },
  {
    value: '408',
    label: 'Железнодорожная будка',
  },
  {
    value: '409',
    label: 'Железнодорожная казарма',
  },
  {
    value: '438',
    label: 'Железнодорожная платформа',
  },
  {
    value: '413',
    label: 'Железнодорожная станция',
  },
  {
    value: '411',
    label: 'Железнодорожный пост',
  },
  {
    value: '412',
    label: 'Железнодорожный разъезд',
  },
  {
    value: '414',
    label: 'Заимка',
  },
  {
    value: '415',
    label: 'Казарма',
  },
  {
    value: '416',
    label: 'Курортный поселок',
  },
  {
    value: '417',
    label: 'Местечко',
  },
  {
    value: '418',
    label: 'Микрорайон',
  },
  {
    value: '419',
    label: 'Населенный пункт',
  },
  {
    value: '420',
    label: 'Остров',
  },
  {
    value: '422',
    label: 'Планировочный район',
  },
  {
    value: '424',
    label: 'Поселок городского типа',
  },
  {
    value: '423',
    label: 'Поселок и(при) станция(и)',
  },
  {
    value: '421',
    label: 'Поселок сельского типа',
  },
  {
    value: '425',
    label: 'Починок',
  },
  {
    value: '427',
    label: 'Почтовое отделение',
  },
  {
    value: '426',
    label: 'Промышленная зона',
  },
  {
    value: '429',
    label: 'Рабочий (заводской) поселок',
  },
  {
    value: '428',
    label: 'Разъезд',
  },
  {
    value: '430',
    label: 'Село',
  },
  {
    value: '431',
    label: 'Слобода',
  },
  {
    value: '433',
    label: 'Станица',
  },
  {
    value: '432',
    label: 'Станция',
  },
  {
    value: '437',
    label: 'Территория',
  },
  {
    value: '434',
    label: 'Улус',
  },
  {
    value: '435',
    label: 'Хутор',
  },
]
