export const formFields = [
  'Состояние',
  'Марка',
  'Модель',
  'Год выпуска',
  'Стоимость',
  'Пробег',
  'Тип ПТС',
  'Серия и номер ПТС',
  'Дата выдачи ПТС',
  'VIN или номер кузова',
  'Номер VIN/кузова',
  'Номер ДКП',
  'Дата ДКП',
  'Юридическое лицо',
  'Сумма кредита',
  'Сумма кредита',

  'Банк получатель денежных средств',
  'Расчетный счет',

  'Кредитный продукт',
  'Первоначальный взнос',
  'Первоначальный взнос в %',
  'Срок',

  'Тип доп оборудования',
  'Тип продукта',
  'Страховая компания или поставщик',
  'Агент получатель',
]

export const legalPersons = [{ value: 'ANEX' }, { value: 'Рога и копыта' }]
export const bankIdentificationCodes = [{ value: '000000000' }, { value: '123456789' }]
export const beneficiaryBanks = [{ value: 'Сбер' }, { value: 'НеСбер' }]
export const bankAccountNumbers = [{ value: '1234123412341234' }, { value: '4321432143214321' }]

export const provider = [
  { value: 'Хороший поставшик' },
  { value: 'Хорошая страховая компания' },
  { value: 'Так себе поставшик' },
]
export const agent = [{ value: 'Хороший агент' }, { value: 'Так себе агент' }]
