/**  Код региона */
export const REGION_CODE = [
  {
    value: '01',
    label: 'Республика Адыгея (Адыгея)',
  },
  {
    value: '02',
    label: 'Республика Башкортостан',
  },
  {
    value: '03',
    label: 'Республика Бурятия',
  },
  {
    value: '04',
    label: 'Республика Алтай',
  },
  {
    value: '05',
    label: 'Республика Дагестан',
  },
  {
    value: '06',
    label: 'Республика Ингушетия',
  },
  {
    value: '07',
    label: 'Кабардино-Балкарская Республика',
  },
  {
    value: '08',
    label: 'Республика Калмыкия',
  },
  {
    value: '09',
    label: 'Карачаево-Черкесская Республика',
  },
  {
    value: '10',
    label: 'Республика Карелия',
  },
  {
    value: '11',
    label: 'Республика Коми',
  },
  {
    value: '12',
    label: 'Республика Марий Эл',
  },
  {
    value: '13',
    label: 'Республика Мордовия',
  },
  {
    value: '14',
    label: 'Республика Саха (Якутия)',
  },
  {
    value: '15',
    label: 'Республика Северная Осетия - Алания',
  },
  {
    value: '16',
    label: 'Республика Татарстан (Татарстан)',
  },
  {
    value: '17',
    label: 'Республика Тыва',
  },
  {
    value: '18',
    label: 'Удмуртская Республика',
  },
  {
    value: '19',
    label: 'Республика Хакасия',
  },
  {
    value: '20',
    label: 'Чеченская Республика',
  },
  {
    value: '21',
    label: 'Чувашская Республика – Чувашия',
  },
  {
    value: '22',
    label: 'Алтайский край',
  },
  {
    value: '23',
    label: 'Краснодарский край',
  },
  {
    value: '24',
    label: 'Красноярский край',
  },
  {
    value: '25',
    label: 'Приморский край',
  },
  {
    value: '26',
    label: 'Ставропольский край',
  },
  {
    value: '27',
    label: 'Хабаровский край',
  },
  {
    value: '28',
    label: 'Амурская область',
  },
  {
    value: '29',
    label: 'Архангельская область',
  },
  {
    value: '30',
    label: 'Астраханская область',
  },
  {
    value: '31',
    label: 'Белгородская область',
  },
  {
    value: '32',
    label: 'Брянская область',
  },
  {
    value: '33',
    label: 'Владимирская область',
  },
  {
    value: '34',
    label: 'Волгоградская область',
  },
  {
    value: '35',
    label: 'Вологодская область',
  },
  {
    value: '36',
    label: 'Воронежская область',
  },
  {
    value: '37',
    label: 'Ивановская область',
  },
  {
    value: '38',
    label: 'Иркутская область',
  },
  {
    value: '39',
    label: 'Калининградская область',
  },
  {
    value: '40',
    label: 'Калужская область',
  },
  {
    value: '41',
    label: 'Камчатская область',
  },
  {
    value: '42',
    label: 'Кемеровская область',
  },
  {
    value: '43',
    label: 'Кировская область',
  },
  {
    value: '44',
    label: 'Костромская область',
  },
  {
    value: '45',
    label: 'Курганская область',
  },
  {
    value: '46',
    label: 'Курская область',
  },
  {
    value: '47',
    label: 'Ленинградская область',
  },
  {
    value: '48',
    label: 'Липецкая область',
  },
  {
    value: '49',
    label: 'Магаданская область',
  },
  {
    value: '50',
    label: 'Московская область',
  },
  {
    value: '51',
    label: 'Мурманская область',
  },
  {
    value: '52',
    label: 'Нижегородская область',
  },
  {
    value: '53',
    label: 'Новгородская область',
  },
  {
    value: '54',
    label: 'Новосибирская область',
  },
  {
    value: '55',
    label: 'Омская область',
  },
  {
    value: '56',
    label: 'Оренбургская область',
  },
  {
    value: '57',
    label: 'Орловская область',
  },
  {
    value: '58',
    label: 'Пензенская область',
  },
  {
    value: '59',
    label: 'Пермская область',
  },
  {
    value: '60',
    label: 'Псковская область',
  },
  {
    value: '61',
    label: 'Ростовская область',
  },
  {
    value: '62',
    label: 'Рязанская область',
  },
  {
    value: '63',
    label: 'Самарская область',
  },
  {
    value: '64',
    label: 'Саратовская область',
  },
  {
    value: '65',
    label: 'Сахалинская область',
  },
  {
    value: '66',
    label: 'Свердловская область',
  },
  {
    value: '67',
    label: 'Смоленская область',
  },
  {
    value: '68',
    label: 'Тамбовская область',
  },
  {
    value: '69',
    label: 'Тверская область',
  },
  {
    value: '70',
    label: 'Томская область',
  },
  {
    value: '71',
    label: 'Тульская область',
  },
  {
    value: '72',
    label: 'Тюменская область',
  },
  {
    value: '73',
    label: 'Ульяновская область',
  },
  {
    value: '74',
    label: 'Челябинская область',
  },
  {
    value: '75',
    label: 'Читинская область',
  },
  {
    value: '76',
    label: 'Ярославская область',
  },
  {
    value: '77',
    label: 'Г. Москва',
  },
  {
    value: '78',
    label: 'Г. Санкт-Петербург',
  },
  {
    value: '79',
    label: 'Еврейская автономная область',
  },
  {
    value: '80',
    label: 'Агинский Бурятский автономный округ',
  },
  {
    value: '81',
    label: 'Коми-Пермяцкий автономный округ',
  },
  {
    value: '82',
    label: 'Корякский автономный округ',
  },
  {
    value: '83',
    label: 'Ненецкий автономный округ',
  },
  {
    value: '84',
    label: 'Таймырский (Долгано - Ненецкий) автономный округ',
  },
  {
    value: '85',
    label: 'Усть-Ордынский Бурятский автономный округ',
  },
  {
    value: '86',
    label: 'Ханты-Мансийский автономный округ',
  },
  {
    value: '87',
    label: 'Чукотский автономный округ',
  },
  {
    value: '88',
    label: 'Эвенкийский автономный округ',
  },
  {
    value: '89',
    label: 'Ямало-Ненецкий автономный округ',
  },
  {
    value: '90',
    label: 'Запорожская область',
  },
  {
    value: '91',
    label: 'Республика Крым',
  },
  {
    value: '92',
    label: 'г. Севастополь',
  },
  {
    value: '93',
    label: 'Донецкая Народная Республика',
  },
  {
    value: '94',
    label: 'Луганская Народная Республика',
  },
  {
    value: '95',
    label: 'Херсонская область',
  },
  {
    value: '99',
    label: 'г. Байконур',
  },
]
/** Тип района */
export const AREA_TYPES = [
  {
    value: '201',
    label: 'Район',
  },
  {
    value: '203',
    label: 'Территория',
  },
  {
    value: '202',
    label: 'Улус',
  },
]

/** Тип города */
export const CITY_TYPES = [
  {
    value: '310',
    label: 'Волость',
  },
  {
    value: '301',
    label: 'Город',
  },
  {
    value: '305',
    label: 'Дачный поселок',
  },
  {
    value: '304',
    label: 'Курортный поселок',
  },
  {
    value: '302',
    label: 'Поселок городского типа',
  },
  {
    value: '311',
    label: 'Почтовое отделение',
  },
  {
    value: '303',
    label: 'Рабочий (заводской) поселок',
  },
  {
    value: '307',
    label: 'Сельская администрация',
  },
  {
    value: '313',
    label: 'Сельская территория',
  },
  {
    value: '309',
    label: 'Сельский округ',
  },
  {
    value: '308',
    label: 'Сельское муницип. образование',
  },
  {
    value: '314',
    label: 'Сельское поселение',
  },
  {
    value: '306',
    label: 'Сельсовет',
  },
  {
    value: '312',
    label: 'Территория',
  },
]

/** Тип улицы */
export const STREET_TYPES = [
  {
    value: '532',
    label: 'Аал',
  },
  {
    value: '501',
    label: 'Аллея',
  },
  {
    value: '533',
    label: 'Аул',
  },
  {
    value: '502',
    label: 'Бульвар',
  },
  {
    value: '503',
    label: 'Въезд',
  },
  {
    value: '534',
    label: 'Выселки(ок)',
  },
  {
    value: '535',
    label: 'Городок',
  },
  {
    value: '536',
    label: 'Деревня',
  },
  {
    value: '504',
    label: 'Дорога',
  },
  {
    value: '539',
    label: 'ж/д остановочный (обгонный) пункт',
  },
  {
    value: '537',
    label: 'Железнодорожная будка',
  },
  {
    value: '538',
    label: 'Железнодорожная казарма',
  },
  {
    value: '559',
    label: 'Железнодорожная платформа',
  },
  {
    value: '542',
    label: 'Железнодорожная станция',
  },
  {
    value: '540',
    label: 'Железнодорожный пост',
  },
  {
    value: '541',
    label: 'Железнодорожный разъезд',
  },
  {
    value: '505',
    label: 'Животноводческая точка',
  },
  {
    value: '506',
    label: 'Заезд',
  },
  {
    value: '507',
    label: 'Квартал',
  },
  {
    value: '508',
    label: 'Километр',
  },
  {
    value: '509',
    label: 'Кольцо',
  },
  {
    value: '510',
    label: 'Линия',
  },
  {
    value: '544',
    label: 'Местечко',
  },
  {
    value: '545',
    label: 'Микрорайон',
  },
  {
    value: '511',
    label: 'Набережная',
  },
  {
    value: '546',
    label: 'Населенный пункт',
  },
  {
    value: '512',
    label: 'Остров',
  },
  {
    value: '513',
    label: 'Парк',
  },
  {
    value: '515',
    label: 'Переезд',
  },
  {
    value: '514',
    label: 'Переулок',
  },
  {
    value: '550',
    label: 'Планировочный район',
  },
  {
    value: '547',
    label: 'Платформа',
  },
  {
    value: '517',
    label: 'Площадка',
  },
  {
    value: '516',
    label: 'Площадь',
  },
  {
    value: '552',
    label: 'Полустанок',
  },
  {
    value: '551',
    label: 'Поселок и(при) станция(и)',
  },
  {
    value: '548',
    label: 'Поселок сельского типа',
  },
  {
    value: '553',
    label: 'Починок',
  },
  {
    value: '549',
    label: 'Почтовое отделение',
  },
  {
    value: '518',
    label: 'Проезд',
  },
  {
    value: '520',
    label: 'Просек',
  },
  {
    value: '521',
    label: 'Проселок',
  },
  {
    value: '519',
    label: 'Проспект',
  },
  {
    value: '522',
    label: 'Проулок',
  },
  {
    value: '554',
    label: 'Разъезд',
  },
  {
    value: '523',
    label: 'Сад',
  },
  {
    value: '555',
    label: 'Село',
  },
  {
    value: '524',
    label: 'Сквер',
  },
  {
    value: '556',
    label: 'Слобода',
  },
  {
    value: '557',
    label: 'Станция',
  },
  {
    value: '525',
    label: 'Строение',
  },
  {
    value: '526',
    label: 'Территория',
  },
  {
    value: '527',
    label: 'Тракт',
  },
  {
    value: '528',
    label: 'Тупик',
  },
  {
    value: '529',
    label: 'Улица',
  },
  {
    value: '530',
    label: 'Участок',
  },
  {
    value: '558',
    label: 'Хутор',
  },
  {
    value: '531',
    label: 'Шоссе',
  },
]

/** Тип населенного пункта */
export const SETTLEMENT_TYPES = [
  {
    value: '401',
    label: 'Аал',
  },
  {
    value: '402',
    label: 'Аул',
  },
  {
    value: '403',
    label: 'Волость',
  },
  {
    value: '404',
    label: 'Выселки(ок)',
  },
  {
    value: '405',
    label: 'Город',
  },
  {
    value: '436',
    label: 'Городок',
  },
  {
    value: '407',
    label: 'Дачный поселок',
  },
  {
    value: '406',
    label: 'Деревня',
  },
  {
    value: '410',
    label: 'ж/д остановочный (обгонный) пункт',
  },
  {
    value: '408',
    label: 'Железнодорожная будка',
  },
  {
    value: '409',
    label: 'Железнодорожная казарма',
  },
  {
    value: '438',
    label: 'Железнодорожная платформа',
  },
  {
    value: '413',
    label: 'Железнодорожная станция',
  },
  {
    value: '411',
    label: 'Железнодорожный пост',
  },
  {
    value: '412',
    label: 'Железнодорожный разъезд',
  },
  {
    value: '414',
    label: 'Заимка',
  },
  {
    value: '415',
    label: 'Казарма',
  },
  {
    value: '416',
    label: 'Курортный поселок',
  },
  {
    value: '417',
    label: 'Местечко',
  },
  {
    value: '418',
    label: 'Микрорайон',
  },
  {
    value: '419',
    label: 'Населенный пункт',
  },
  {
    value: '420',
    label: 'Остров',
  },
  {
    value: '422',
    label: 'Планировочный район',
  },
  {
    value: '424',
    label: 'Поселок городского типа',
  },
  {
    value: '423',
    label: 'Поселок и(при) станция(и)',
  },
  {
    value: '421',
    label: 'Поселок сельского типа',
  },
  {
    value: '425',
    label: 'Починок',
  },
  {
    value: '427',
    label: 'Почтовое отделение',
  },
  {
    value: '426',
    label: 'Промышленная зона',
  },
  {
    value: '429',
    label: 'Рабочий (заводской) поселок',
  },
  {
    value: '428',
    label: 'Разъезд',
  },
  {
    value: '430',
    label: 'Село',
  },
  {
    value: '431',
    label: 'Слобода',
  },
  {
    value: '433',
    label: 'Станица',
  },
  {
    value: '432',
    label: 'Станция',
  },
  {
    value: '437',
    label: 'Территория',
  },
  {
    value: '434',
    label: 'Улус',
  },
  {
    value: '435',
    label: 'Хутор',
  },
]
